package com.jucaifu.common.validate;

//验证数字：^[0-9]*$
//验证n位的数字：^\d{n}$
//验证至少n位数字：^\d{n,}$
//验证m-n位的数字：^\d{m,n}$
//验证零和非零开头的数字：^(0|[1-9][0-9]*)$
//验证有两位小数的正实数：^[0-9]+(.[0-9]{2})?$
//验证有1-3位小数的正实数：^[0-9]+(.[0-9]{1,3})?$
//验证非零的正整数：^\+?[1-9][0-9]*$
//验证非零的负整数：^\-[1-9][0-9]*$
//验证非负整数（正整数 + 0）  ^\d+$
//验证非正整数（负整数 + 0）  ^((-\d+)|(0+))$
//验证长度为3的字符：^.{3}$
//验证由26个英文字母组成的字符串：^[A-Za-z]+$
//验证由26个大写英文字母组成的字符串：^[A-Z]+$
//验证由26个小写英文字母组成的字符串：^[a-z]+$
//验证由数字和26个英文字母组成的字符串：^[A-Za-z0-9]+$
//验证由数字、26个英文字母或者下划线组成的字符串：^\w+$
//验证用户密码:^[a-zA-Z]\w{5,17}$ 正确格式为：以字母开头，长度在6-18之间，只能包含字符、数字和下划线。
//验证是否含有 ^%&',;=?$\" 等字符：[^%&',;=?$\x22]+
//验证汉字：^[\u4e00-\u9fa5],{0,}$
//验证Email地址：^\w+[-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$
//验证InternetURL：^http://([\w-]+\.)+[\w-]+(/[\w-./?%&=]*)?$ ；^[a-zA-z]+://(w+(-w+)*)(.(w+(-w+)*))*(?S*)?$
//验证电话号码：^(\(\d{3,4}\)|\d{3,4}-)?\d{7,8}$：--正确格式为：XXXX-XXXXXXX，XXXX-XXXXXXXX，XXX-XXXXXXX，XXX-XXXXXXXX，XXXXXXX，XXXXXXXX。
//验证身份证号（15位或18位数字）：^\d{15}|\d{18}$
//验证一年的12个月：^(0?[1-9]|1[0-2])$ 正确格式为：“01”-“09”和“1”“12”
//验证一个月的31天：^((0?[1-9])|((1|2)[0-9])|30|31)$    正确格式为：01、09和1、31。
//整数：^-?\d+$
//非负浮点数（正浮点数 + 0）：^\d+(\.\d+)?$
//正浮点数   ^(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*))$
//非正浮点数（负浮点数 + 0） ^((-\d+(\.\d+)?)|(0+(\.0+)?))$
//负浮点数  ^(-(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*)))$
//浮点数  ^(-?\d+)(\.\d+)?$

/**
 * ****************************************
 *
 * @author : scofieldcai@126.com
 * @ClassName : ValidateType
 * @date : 2014-3-12 下午2:30:42
 * @Description: 数据校验类型
 * ****************************************
 **/
public enum ValidateType {

    /**
     * 自定义类型
     */
    CUSTOM_TYPE(),

    /**
     * 非空校验
     */
    NOT_EMPTY(),

    /**
     * 手机号码
     */
    PHONE_NUMBER("1\\d{10}", "手机号码"),

    /**
     * 身份证
     */
    USER_ID_CARD("\\d{15}|\\d{18}|\\d{17}+[A-Za-z]{1}", "身份证"),

    /**
     * ip地址
     */
    IP_ADDRESS("((?:(?:25[0-5]|2[0-4]\\d|((1\\d{2})|([1-9]?\\d)))\\.){3}(?:25[0-5]|2[0-4]\\d|((1\\d{2})|([1-9]?\\d))))", "ip地址"),

    /**
     * 邮箱
     */
    EMAIL_ADDRESS("^([a-z0-9A-Z]+[-|\\.]?)+[a-z0-9A-Z]@([a-z0-9A-Z]+(-[a-z0-9A-Z]+)?\\.)+[a-zA-Z]{2,}$", "邮箱"),

    /**
     * 登陆密码（8-20）
     */
    TZGL_LOGIN_PWD("^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z_]{8,20}$","密码"),

    /**
     * 登陆密码（6-16）
     */
    TZGL_LOGIN_PWD2("^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z_]{6,16}$","密码"),

    /**
     * 登陆密码特殊字符（6-16）
     */
    TZGL_LOGIN_PWD3("^(?![0-9]+$)(?![a-zA-Z]+$)([0-9A-Za-z]|[`~!@#$%^&*()+=|{}':;',\\[\\].<>/?~！@#￥%……&*（）——+|{}【】‘；：”“’。，、？]){6,16}$","密码"),

    /**
     * 聚财富登录密码
     */
    LOGIN_PWD("[0-9a-zA-Z_]{8,20}", "登录密码"),

    /**
     * 聚财富登录密码
     */
    LOGIN_NAME("[0-9a-zA-Z_]{8,20}", "登录密码"),

    /**
     * 后台系统,员工登陆密码
     */
    EMPLOYEE_LOGIN_PWD("[0-9a-zA-Z_]{1,20}", "密码"),


    /**
     * 数字资产员工登陆密码
     */
    SZZC_LOGIN_PWD("^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z_]{6,16}$", "数字资产密码"),
    /**
     * 支付密码
     */
    PAY_PWD("\\d{6}", "支付密码"),

    /**
     * 取款密码
     */
    PIN_PWD("\\d{6}", "取款密码"),

    /**
     * 查询密码
     */
    SEARCH_PWD("\\d{6}", "查询密码"),

    /**
     * 短信验证码
     */
    VERIFICATION_CODE("\\d{6}", "短信验证码"),

    /**
     * 预留信息
     */
    RESERVED_INFOMATION("([0-9a-zA-Z]{2,28})|([\u4e00-\u9fa5]{1,14})", "预留信息"),

    /**
     * 借记卡
     */
    DEBIT_CARD("\\d{16}", "借记卡"),

    /**
     * 存折
     */
    BANK_BOOK("\\d{18}", "存折"),

    /**
     * 信用卡
     */
    CREDIT_CARD("\\d{16}", "信用卡"),

    /**
     * 账户户主
     */
    ACCOUNT_NAME("([\u4e00-\u9fa5]{2,4})|[a-zA-Z ]{1,14}", "账户户主"),

    /**
     * 短信留言
     */
    SMG_CONTENT(".{0,24}", "短信留言"),

    /**
     * 电费编号
     */
    PAYMENT_ELECTRICITY_BILL_NO("[0-9a-zA-Z]{1,20}", "电费编号"),

    /**
     * 水费编号
     */
    PAYMENT_WATER_BILL_NO("[0-9a-zA-Z]{1,20}", "水费编号"),

    /**
     * 转账金额：大于0，且最多2位小数
     */
    MONEY("([1-9]\\d{0,}(.\\d{0,2}){0,1})|(0.0[1-9])|(0.[1-9]\\d{0,1})", "转账金额"),

    /**
     * 防钓鱼码
     */
    FINSH_CODE("[0-9a-zA-Z_]{10,16}", "防钓鱼码"),

    /**
     * 数字
     */
    DIGITAL("^[0-9]*$", "数字");

    ValidateType() {
    }

    /*****************************************
     * @author : scofieldcai@126.com
     * @Title :
     * @Description: 根据tagMSG自动添加不同的后缀。
     *****************************************/
    ValidateType(String validateRuleRegex, String tagMSG) {
        this.validateRuleRegex = validateRuleRegex;
        this.emptyMSG = tagMSG + "不能为空。";
        this.errorMSG = tagMSG + "不合法。";
    }

    /*****************************************
     * @author : scofieldcai@126.com
     * @Title :
     * @Description: 自定义非空提示信息和格式错误提示信息。
     *****************************************/
    ValidateType(String validateRuleRegex, String emptyMSG, String errorMSG) {
        this.validateRuleRegex = validateRuleRegex;
        this.emptyMSG = emptyMSG;
        this.errorMSG = errorMSG;
    }

    private String validateRuleRegex;
    private String emptyMSG;
    private String errorMSG;

    public String getValidateRuleRegex() {
        return validateRuleRegex;
    }

    public String getEmptyMSG() {
        return emptyMSG;
    }

    public String getErrorMSG() {
        return errorMSG;
    }
}
